notes/diappi_2008_Smith.org
:PROPERTIES:
:ID:       8da2a8cb-0ba8-4fbf-9b25-9e67a8dd3ec4
:mtime:    20211202152742 20211013082514
:ctime:    20211013082514
:END:
#+TITLE:  (2008, ): Smith's rent gap theory and local real estate dynamics: A multi-agent model
#+OPTIONS: toc:nil num:nil
#+filetags: Gentrification ABM Spatial
Time-stamp: 2021-05-20
- tags :: Cellular automata,Multi-agent systems,Real estate market,Rent gap

* Backlinks

[[id:673f4082-43a5-4f2a-a9c0-759304a2bb2c][ABM Readings]]

* FISH-5SS
|---------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| <40>                                        | <50>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| *Background*                                  | For urban economics, there is a competition among central business district and the residential ring in order to achieve the closest location to the city centre. As a consequence, urban rent is higher at the city center and decrease on all sides toward the periphery. The gentrification process, however, could not be associate to a local positive externatily (different fertility of Ricardo), but as a result of a interactive process among economic agents. New Urban Economics (NUE, simular to the New Institutionalist Economic) focus on methodological individualism. As a consequence, gentrification is not a result of collective dynamics, but is a manifastation of a negative externality. Gentrification supply-side approach states that capital finds it woth investing in decayed urban areas due to the potential gains from the substation increases in land rent and land value. Population turnonver is a consequence. |
| *Supporting Ideas*                            | "Smith's rent gap theory": Investors or developers invest in degrated areas on the base on the gap between the actual rent and the potential rent after reabilitation (rent gap). Property owners immitate the behaviour and benefits from the advantage of the improvement of the quality of the nearby buildings, and thus, their rents arises. Gentrification could be defined as a population turn-over in favor of the middle-upper class as a result of residential property price increase.                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| *Purpose*                                     | Analyse the determinants of gentrification.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |
| *Originality/value (Contribution)*            | In Smith's seminar paper, *space* and not quality of the neighborhood is the founding element to gentrification.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| *Relevance*                                   | Provides some insight on both investors behaviour and economic-spatial segregation.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| *Design/methodology/approach*                 | Method: ABM; Agents (Design): homewoner, landlord, tenant, developer and "property unit" as a passive agent. Landspace: square grid in a toroidal space.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |
| *Results*                                     | The larger the neighborhood radius ($r$), the higher the gentrification effect is; the higher rent gap threshold ($\delta$), the lower is the average current rent; for a value higher than 0.8 there is an increasing volatility; The more capital resources are available, more intense the gentrification effect is and landscame becomes more seggregated.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| *(Interesting) Findings*                      |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| *Research limitations/implications (Critics)* | Credit (available capital) is exogenous and constant in the simulations. There is no feedback between house prices and economic variables (spatially isolated).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| *Uncategorized stuff*                         |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| *5SS*                                         |                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
|---------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|

* Specifics comments
 :PROPERTIES:
 :Custom_ID: diappi_2008_Smith
 :AUTHOR: Diappi, L., & Bolchi, P.
 :JOURNAL: Computers, Environment and Urban Systems
 :YEAR: 2008
 :DOI:  http://dx.doi.org/10.1016/j.compenvurbsys.2006.11.003
 :URL:
 :END:


** Equations

*** Conservation state ($D$)

#+BEGIN_latex
\begin{equation}
D(x,t) = \exp^{-\lambda x_{i}}
\end{equation}
#+END_latex
in which $x$ is the bilding age and $\lambda$ is the annual decay rate.

*** Current rent ($CR$) and Neighborhood Rent ($NR$)
#+BEGIN_latex
\begin{equation}
CR_{i}(x,t_{0}) = PR_{i}(t_{0})\cdot D(x,t)
\end{equation}
#+END_latex
inittialy ($t_{0}$), the current rent is equal to the potential rent ($PR$) and then decay as previously describe. After the rehabilitating their property, the $CR$ do not exced the neighborhood current rent ($NR$):
#+BEGIN_latex
\begin{equation}
NR(r,t) = \frac{\Sum^{J}_{j=1}CR_{j}(x,t)}{J}
\end{equation}
in which $r$ is the neighborhood radius and $J$ is the number of houses in this area.
#+END_latex

*** Construction Costs ($C$)

#+BEGIN_latex
\begin{equation}
C(x) = C_{0}(1-D(x))
\end{equation}
#+END_latex
in which $C_{0}$ is the initial construction cost.

*** Decision to invest

The decision on wheter to invest or not in the property unit is based on the comparison between the expected increase in rent and related costs:
#+BEGIN_latex
\begin{equation}
\begin{cases}
\text{Invest}\,\,\,\text{if}\, NR - CR > C\\
\text{Do nothing}\,\,\,\, \text{otherwise}
\end{cases}
\end{equation}
#+END_latex

*** Rent Gap ($RG$)

#+BEGIN_latex
\begin{equation}
RG = \frac{PR - CR}{PR}
\end{equation}
#+END_latex
among those options where $RG > \delta$, investors selection a random property unity and invest all the available capital.
Thus, the age of the building is reseted and its curent rent matches the potential one.
