docs/notes/diappi_2008_Smith.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2021-09-09 qui 15:59 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=utf-8" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />
  <title>(2008, ): Smith's rent gap theory and local real estate
  dynamics: A multi-agent model</title>
  <meta name="author" content="Gabriel Petrini" />
  <meta name="generator" content="Org Mode" />
</head>
<body>
  <div id="content" class="content">
    <h1 class="title">(2008, ): Smith’s rent gap theory and local
    real estate dynamics: A multi-agent model</h1>
    <p>Time-stamp: 2021-05-20</p>
    <dl class="org-dl">
      <dt>tags</dt>
      <dd>Cellular automata,Multi-agent systems,Real estate
      market,Rent gap</dd>
    </dl>
    <div id="outline-container-orgaba8d5b" class="outline-2">
      <h2 id="orgaba8d5b">Backlinks</h2>
      <div class="outline-text-2" id="text-orgaba8d5b">
        <p><a href=
        "20210210100407-abm_readings.html#ID-673f4082-43a5-4f2a-a9c0-759304a2bb2c">
        ABM Readings</a></p>
      </div>
    </div>
    <div id="outline-container-org5593d56" class="outline-2">
      <h2 id="org5593d56">FISH-5SS</h2>
      <div class="outline-text-2" id="text-org5593d56">
        <table border="2" cellspacing="0" cellpadding="6" rules=
        "groups" frame="hsides">
          <colgroup>
            <col class="org-left" />
            <col class="org-left" />
          </colgroup>
          <tbody>
            <tr>
              <td class="org-left"><b>Background</b></td>
              <td class="org-left">For urban economics, there is a
              competition among central business district and the
              residential ring in order to achieve the closest
              location to the city centre. As a consequence, urban
              rent is higher at the city center and decrease on all
              sides toward the periphery. The gentrification
              process, however, could not be associate to a local
              positive externatily (different fertility of
              Ricardo), but as a result of a interactive process
              among economic agents. New Urban Economics (NUE,
              simular to the New Institutionalist Economic) focus
              on methodological individualism. As a consequence,
              gentrification is not a result of collective
              dynamics, but is a manifastation of a negative
              externality. Gentrification supply-side approach
              states that capital finds it woth investing in
              decayed urban areas due to the potential gains from
              the substation increases in land rent and land value.
              Population turnonver is a consequence.</td>
            </tr>
            <tr>
              <td class="org-left"><b>Supporting Ideas</b></td>
              <td class="org-left">“Smith’s rent gap theory”:
              Investors or developers invest in degrated areas on
              the base on the gap between the actual rent and the
              potential rent after reabilitation (rent gap).
              Property owners immitate the behaviour and benefits
              from the advantage of the improvement of the quality
              of the nearby buildings, and thus, their rents
              arises. Gentrification could be defined as a
              population turn-over in favor of the middle-upper
              class as a result of residential property price
              increase.</td>
            </tr>
            <tr>
              <td class="org-left"><b>Purpose</b></td>
              <td class="org-left">Analyse the determinants of
              gentrification.</td>
            </tr>
            <tr>
              <td class="org-left"><b>Originality/value
              (Contribution)</b></td>
              <td class="org-left">In Smith’s seminar paper,
              <b>space</b> and not quality of the neighborhood is
              the founding element to gentrification.</td>
            </tr>
            <tr>
              <td class="org-left"><b>Relevance</b></td>
              <td class="org-left">Provides some insight on both
              investors behaviour and economic-spatial
              segregation.</td>
            </tr>
            <tr>
              <td class="org-left">
              <b>Design/methodology/approach</b></td>
              <td class="org-left">Method: ABM; Agents (Design):
              homewoner, landlord, tenant, developer and “property
              unit” as a passive agent. Landspace: square grid in a
              toroidal space.</td>
            </tr>
            <tr>
              <td class="org-left"><b>Results</b></td>
              <td class="org-left">The larger the neighborhood
              radius (\(r\)), the higher the gentrification effect
              is; the higher rent gap threshold (\(\delta\)), the
              lower is the average current rent; for a value higher
              than 0.8 there is an increasing volatility; The more
              capital resources are available, more intense the
              gentrification effect is and landscame becomes more
              seggregated.</td>
            </tr>
            <tr>
              <td class="org-left"><b>(Interesting)
              Findings</b></td>
              <td class="org-left">&nbsp;</td>
            </tr>
            <tr>
              <td class="org-left"><b>Research
              limitations/implications (Critics)</b></td>
              <td class="org-left">Credit (available capital) is
              exogenous and constant in the simulations. There is
              no feedback between house prices and economic
              variables (spatially isolated).</td>
            </tr>
            <tr>
              <td class="org-left"><b>Uncategorized stuff</b></td>
              <td class="org-left">&nbsp;</td>
            </tr>
            <tr>
              <td class="org-left"><b>5SS</b></td>
              <td class="org-left">&nbsp;</td>
            </tr>
          </tbody>
        </table>
      </div>
    </div>
    <div id="outline-container-diappi_2008_Smith" class=
    "outline-2">
      <h2 id="diappi_2008_Smith">Specifics comments</h2>
      <div class="outline-text-2" id="text-diappi_2008_Smith">
      </div>
      <div id="outline-container-org873ec23" class="outline-3">
        <h3 id="org873ec23">Equations</h3>
        <div class="outline-text-3" id="text-org873ec23"></div>
        <div id="outline-container-org60915be" class="outline-4">
          <h4 id="org60915be">Conservation state (\(D\))</h4>
          <div class="outline-text-4" id="text-org60915be">
            <div class="latex" id="org3299e1b">
              \begin{equation} D(x,t) = \exp^{-\lambda x_{i}}
              \end{equation}
            </div>
            <p>in which \(x\) is the bilding age and \(\lambda\) is
            the annual decay rate.</p>
          </div>
        </div>
        <div id="outline-container-org0545132" class="outline-4">
          <h4 id="org0545132">Current rent (\(CR\)) and
          Neighborhood Rent (\(NR\))</h4>
          <div class="outline-text-4" id="text-org0545132">
            <div class="latex" id="orgbf6e434">
              \begin{equation} CR_{i}(x,t_{0}) = PR_{i}(t_{0})\cdot
              D(x,t) \end{equation}
            </div>
            <p>inittialy (\(t_{0}\)), the current rent is equal to
            the potential rent (\(PR\)) and then decay as
            previously describe. After the rehabilitating their
            property, the \(CR\) do not exced the neighborhood
            current rent (\(NR\)):</p>
            <div class="latex" id="org4626e0d">
              \begin{equation} NR(r,t) =
              \frac{\Sum^{J}_{j=1}CR_{j}(x,t)}{J} \end{equation}
              <p>in which \(r\) is the neighborhood radius and
              \(J\) is the number of houses in this area.</p>
            </div>
          </div>
        </div>
        <div id="outline-container-orgc177182" class="outline-4">
          <h4 id="orgc177182">Construction Costs (\(C\))</h4>
          <div class="outline-text-4" id="text-orgc177182">
            <div class="latex" id="orgb0a4b21">
              \begin{equation} C(x) = C_{0}(1-D(x)) \end{equation}
            </div>
            <p>in which \(C_{0}\) is the initial construction
            cost.</p>
          </div>
        </div>
        <div id="outline-container-orga9a4f7a" class="outline-4">
          <h4 id="orga9a4f7a">Decision to invest</h4>
          <div class="outline-text-4" id="text-orga9a4f7a">
            <p>The decision on wheter to invest or not in the
            property unit is based on the comparison between the
            expected increase in rent and related costs:</p>
            <div class="latex" id="org5bad279">
              \begin{equation} \begin{cases}
              \text{Invest}\,\,\,\text{if}\, NR - CR &gt; C\\
              \text{Do nothing}\,\,\,\, \text{otherwise}
              \end{cases} \end{equation}
            </div>
          </div>
        </div>
        <div id="outline-container-org5a7f34b" class="outline-4">
          <h4 id="org5a7f34b">Rent Gap (\(RG\))</h4>
          <div class="outline-text-4" id="text-org5a7f34b">
            <div class="latex" id="org0594fe4">
              \begin{equation} RG = \frac{PR - CR}{PR}
              \end{equation}
            </div>
            <p>among those options where \(RG &gt; \delta\),
            investors selection a random property unity and invest
            all the available capital. Thus, the age of the
            building is reseted and its curent rent matches the
            potential one.</p>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div id="postamble" class="status">
    <p class="author">Author: Gabriel Petrini</p>
    <p class="date">Created: 2021-09-09 qui 15:59</p>
  </div>
</body>
</html>
